# დავალება 3

# Control flow-ის სამი ძირითადი კომპონენტი შემდეგია:

# Sequential (წინ წაწევა): ეს არის კოდი, რომელიც პირდაპირ შეიძლება შესრულდეს ერთიანი სწორი თანმიმდევრობით. ყოველ ჯერზე,
# როდესაც პროგრამა იწყება, ის კოდის ხაზებს ათავსებს შესაბამისი რიგითობის მიხედვით. სხვა სიტყვებით, პროგრამა ამავე რიგში შესრულდება, თუ არ იქნება რაიმე ცვლილება სხვა ტიპის control flow-დან.

# Conditional Statements (დასაბუთებული განცხადებები): აქ გამოყენებულია if, elif, else სტრუქტურები, რომლებიც გადაწყვეტილების მიღებას გთავაზობთ.
# ეს ნიშნავს, რომ გარკვეულ პირობაზე დამოკიდებული კოდი შეიძლება შესრულდეს ან არ შესრულდეს. მაგალითად, if statement-ით შესაძლებელია შეამოწმოთ, შეასრულოთ ერთ-ერთი ქმედება თუ პირობა დგება, ან სხვა ქმედება, თუ პირობა არ დგება.

# Loops (ციკლები): ეს არის ისეთი სტრუქტურები, რომლებიც საშუალებას გაძლევთ რეალურად ამოიცნოთ და შეასრულოთ გარკვეული მოქმედებები გარკვეული დროის განმავლობაში,
# სანამ ციკლის პირობები შესრულდება. For და while ციკლები ამაში ყველაზე გავრცელებული საშუალებებია.


# დავალება 4

# იტერაცია არის პროცესი, როდესაც კოდი გარკვეული პერიოდის განმავლობაში მრავალჯერ იძახება ან შესრულდება.
# ეს მექანიზმი ეხმარება მასას მრავალჯერადი ამოცანების შესრულებაში, მაგალითად, როდესაც გარკვეული მონაცემები ან ელემენტები უნდა იყოს გადაკვეთილი.

# for და while ციკლები კი განსხვავდებიან იმით, რომ:

# for loop გამოიყენება, როდესაც ვიცით რამდენიIteration-ი უნდა მოხდეს. მაგალითად, თუ 1-დან 10-მდე რიცხვებს ვიმუშავებთ, ამ ციკლში გვეცოდინება რამდენი გაიმეორება კოდი.
# მაგ:
# 
# for i in range(1, 11):
#     print(i)

# while loop გამოიყენება, როდესაც ციკლის რაოდენობა არ არის განსაზღვრული და მისი შეწყვეტა ხდება მხოლოდ გარკვეული პირობის დაკმაყოფილების შემდეგ.
# მაგ:

# i = 1
# while i <= 10:
#     print(i)
#     i += 1


# დავალება 5


# total = 0
# for i in range(1, 11):
#     total += i
# print("sum:", total)


# # დავალება 6


# total = 0
# i = 1
# while i <= 10:
#     total += i
#     i += 1
# print("sum:", total)


# # დავალება 7


# for i in range(2, 21, 2):
#     print(i)


# # დავალება 8


# i = 31  
# while i <= 70:
#     print(i)
#     i += 2


# დავალება 9


fruits = ["apple", "banana", "cherry"]
print(fruits[0])  # Output will be "apple"
